In [1]:
import pandas as pd
import numpy as np


from sqlalchemy import create_engine
import pylab as plt
import matplotlib.pyplot as plt

In [2]:
str_conn='mysql+pymysql://root:tupassword@localhost:3306/publication'


motor=create_engine(str_conn)

# Autores con mejores royalties

In [3]:
top_royalties = pd.read_sql('''select t.title_id as 'TITLE ID',
                                    a.au_id as 'AUTHOR ID',
                                    sum(t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100) as 'ROYALTY'
                            from authors a

                            left join titleauthor ta
                            on ta.au_id = a.au_id

                            left join titles t
                            on ta.title_id = t.title_id

                            left join sales s
                            on t.title_id = s.title_id

                            group by a.au_id, t.title_id

                            order by sum(t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100) desc
                            
                            limit 5'''

                            ,motor)
top_royalties

  TITLE ID    AUTHOR ID  ROYALTY
0   PC1035  238-95-7766  110.160
1   TC3218  807-91-6654   83.800
2   PS2091  899-46-2035   70.956
3   PS2091  998-72-3567   70.956
4   PC8888  427-17-2319   50.000

In [4]:
# Insertar un pie plot

# Autores con mayores ingresos a lo largo del tiempo

In [5]:
max_profit = pd.read_sql('''select	a.au_id as 'AUTHOR ID',
                                    a.au_fname as 'Name',
                                    a.au_lname as 'Last Name',
                                    sum(t.advance + (t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100)) as 'PROFIT'
                            from authors a

                            left join titleauthor ta
                            on ta.au_id = a.au_id

                            left join titles t
                            on ta.title_id = t.title_id

                            left join sales s
                            on t.title_id = s.title_id

                            group by a.au_id, t.title_id

                            order by sum(t.advance + (t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100)) desc
                            
                            limit 10;''', motor)

max_profit

     AUTHOR ID      Name Last Name     PROFIT
0  722-51-5454    Michel  DeFrance  30021.528
1  899-46-2035      Anne    Ringer  30007.176
2  213-46-8915  Marjorie     Green  10150.116
3  409-56-7008   Abraham    Bennet  10017.991
4  213-46-8915  Marjorie     Green  10011.994
5  899-46-2035      Anne    Ringer   9170.956
6  998-72-3567    Albert    Ringer   9170.956
7  846-92-7186    Sheryl    Hunter   8050.000
8  427-17-2319       Ann      Dull   8050.000
9  672-71-3249     Akiko  Yokomoto   8011.992

# Categorías más vendidas

In [6]:
most_sales = pd.read_sql('''select	t.type as 'Categoría',
                                    count(t.title) as 'Número de ventas',
                                    s.stor_id as 'Store'
                            from titles as t

                            left join sales as s
                            on s.title_id = t.title_id

                            group by t.type

                            order by count(t.title) desc;''', motor)
most_sales

      Categoría  Número de ventas Store
0    psychology                 8  7131
1      business                 5  6380
2      mod_cook                 3  7896
3  popular_comp                 3  8042
4     trad_cook                 3  7067
5     UNDECIDED                 1  None

In [7]:
bst_book_sales = pd.read_sql(''' select t.title as 'Titulo',
                                        t.type as 'Categoría',
                                        count(s.ord_num) as 'Pedidos'
                                from sales as s

                                left join titles as t
                                on s.title_id = t.title_id

                                group by t.title

                                order by count(s.ord_num) desc
                                ;''', motor)
bst_book_sales.head()

                                              Titulo   Categoría  Pedidos
0                                Is Anger the Enemy?  psychology        4
1                The Busy Executive's Database Guide    business        2
2                              The Gourmet Microwave    mod_cook        2
3  Cooking with Computers: Surreptitious Balance ...    business        1
4                    You Can Combat Computer Stress!    business        1

# Ciudades en las que se encuentran publishers

In [8]:
publishers = pd.read_sql('''select p.city from publishers as p;''', motor)

publishers

         city
0      Boston
1  Washington
2    Berkeley
3     Chicago
4      Dallas
5     Mnchen
6    New York
7       Paris

In [9]:
publishers_sales = pd.read_sql('''select	p.city as 'Ciudad',
                                            count(s.ord_num) as 'Pedidos'
                                    from titles as t

                                    left join publishers as p
                                    on p.pub_id = t.pub_id

                                    left join sales as s
                                    on s.title_id = t.title_id

                                    group by p.city

                                    ;''', motor)

publishers_sales

       Ciudad  Pedidos
0      Boston        8
1  Washington        7
2    Berkeley        6